extends Resource
class_name MenuConfig

# Ingredient lists
const BROTH_TYPES: Array[String] = [
	"แห้ง",    # dry (no soup)
	"น้ำใส",
	"น้ำข้น",
	"ต้มยำ",
	"เย็นตาโฟ",
]

const NOODLE_TYPES: Array[String] = [
	"เส้นเล็ก",
	"เส้นหมี่",
	"วุ้นเส้น",
	"บะหมี่",
	"เส้นใหญ่",
]

const MEAT_TYPES: Array[String] = [
	"ลูกชิ้น",
	"เนื้อตุ๋น",
	"หมูเด้ง",
	"น่องไก่",
]

const VEGETABLE_TYPES: Array[String] = [
	"ต้นหอมผักชี",
	"ถั่วงอก",
	"กระเทียมเจียว",
]

const DRINK_TYPES: Array[String] = [
	"โอเลี้ยง",
	"กระเจี๊ยบ",
	"เก๊กฮวย",
]


# Customer name pools
const NORMAL_CUSTOMER_NAMES: Array[String] = [
	"พี่ต่อ",
	"ป้าแป้ง",
	"ลุงหมู",
	"พี่นิด",
	"พี่เมย์",
	"พี่ต้น",
	"น้าเจี๊ยบ",
	"ลุงสมชาย",
	"พี่เก่ง",
	"พี่แนน",
	"น้าแดง",
	"พี่อาร์ต",
	"ป้าจิก",
	"น้าจอย",
	"ป้าต้อย",
	"พี่เก่ง",
	"พี่แนน",
	"ลุงสมชาย",
	"น้าแดง",
	"พี่อาร์ต",
	"ป้ามะลิ",
	"พี่บอย",
	"น้าเชียร",
	"พี่กุ้ง",
	"ลุงหวัง",
	"ป้าจิก",
	"พี่หนุ่ม"
]

const SPECIAL_CUSTOMER_NAMES: Array[String] = [
	"คุณศุภกฤตศักดิ์เดชากร",
	"คุณพรพรหมรัตนมาศ",
	"คุณอัครมหาไพศาล",
	"คุณเบญจมินทรากุล",
	"คุณวิวัฒน์ธนโชติอนันต์",
	"คุณประเสริฐเลิศวิจิตร",
	"คุณรัตนไพโรจน์กิจ",
	"คุณธนภัทรโภคินทร์"
]

const CHILD_CUSTOMER_NAMES: Array[String] = [
	"น้องออม",
	"น้องปั้นแป้ง",
	"น้องฟีฟี",
	"น้องค็อกเทล",
	"น้องหมูเด้ง", 
	"น้องกอหญ้า",
	"น้องพาสต้า",
	"น้องออกัส",
	"น้องเมล่อน",
	"น้องตะวัน",
	"น้องเพนกวิน"
]
